<h1 style="color: darkgrey; font-size: 24px; font-weight: bolder; text-align: center;">Connecting to a SQL Database using Python<\h1>
    <h2 style="color: darkgrey; font-size: 12px; text-align: center; padding-top: 0px">Introduction to pyodbc and pandas.io.sql<\h2>

The first step when trying to retrieve infrmation from a SQL Database is to know the name of the server where it is located. You should have installed the SSMS -SQL Server Management Studio-. After selecting the "Database Engine Option" from the startup menu you will be able to get the server name, database name and the table name.

In [9]:
import pyodbc
conn = pyodbc.connect('Driver={SQL Server};'
                      'Server=.;'
                      'Database=AdventureWorks2017;'
                      'Trusted_Connection=yes;')

cursor = conn.cursor()
raw_data=cursor.execute('SELECT * FROM Person.Person')
type(raw_data)

pyodbc.Cursor

With the code shown above we created a pyodbc object named "Cursor" and assigned it to the variable raw_data. However, when printing the first 5 rows, which match the results stored in our table, the format is still not convenient for our purpose. What we need is a pandas data frame.

In [10]:
count=0
for i in raw_data:
    print(i)
    if count==3:
        break
    count+=1

(1, 'EM', False, None, 'Ken', 'J', 'Sánchez', None, 0, None, '<IndividualSurvey xmlns="http://schemas.microsoft.com/sqlserver/2004/07/adventure-works/IndividualSurvey"><TotalPurchaseYTD>0</TotalPurchaseYTD></IndividualSurvey>', '92C4279F-1207-48A3-8448-4636514EB7E2', datetime.datetime(2009, 1, 7, 0, 0))
(2, 'EM', False, None, 'Terri', 'Lee', 'Duffy', None, 1, None, '<IndividualSurvey xmlns="http://schemas.microsoft.com/sqlserver/2004/07/adventure-works/IndividualSurvey"><TotalPurchaseYTD>0</TotalPurchaseYTD></IndividualSurvey>', 'D8763459-8AA8-47CC-AFF7-C9079AF79033', datetime.datetime(2008, 1, 24, 0, 0))
(3, 'EM', False, None, 'Roberto', None, 'Tamburello', None, 0, None, '<IndividualSurvey xmlns="http://schemas.microsoft.com/sqlserver/2004/07/adventure-works/IndividualSurvey"><TotalPurchaseYTD>0</TotalPurchaseYTD></IndividualSurvey>', 'E1A2555E-0828-434B-A33B-6F38136A37DE', datetime.datetime(2007, 11, 4, 0, 0))
(4, 'EM', False, None, 'Rob', None, 'Walters', None, 0, None, '<IndividualSurvey xmlns="http://schemas.microsoft.com/sqlserver/2004/07/adventure-works/IndividualSurvey"><TotalPurchaseYTD>0</TotalPurchaseYTD></IndividualSurvey>', 'F2D7CE06-38B3-4357-805B-F4B6B71C01FF', datetime.datetime(2007, 11, 28, 0, 0))

When running the same query but in SQL server, then we can assure that the results are matching

<img max-width=300px src="results1.png">

Working on this data and make it a dataframe from scratch would be a harsh and a time consuming job. Fortunately, there is another python package where we can run the any SQL query "pandas.io.sql"

In [11]:
import pandas.io.sql

In [13]:
tblperson= pandas.io.sql.read_sql('SELECT * FROM Person.Person', conn)
tblperson.head(n=3)

,BusinessEntityID,PersonType,NameStyle,Title,FirstName,MiddleName,LastName,Suffix,EmailPromotion,AdditionalContactInfo,Demographics,rowguid,ModifiedDate
0,1,EM,False,None,Ken,J,Sánchez,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",92C4279F-1207-48A3-8448-4636514EB7E2,2009-01-07
1,2,EM,False,None,Terri,Lee,Duffy,None,1,None,"<IndividualSurvey xmlns=""http://schemas.micros...",D8763459-8AA8-47CC-AFF7-C9079AF79033,2008-01-24
2,3,EM,False,None,Roberto,None,Tamburello,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",E1A2555E-0828-434B-A33B-6F38136A37DE,2007-11-04

From now on we can use a similar code to bring tables from the database.

In [14]:
tblProduct= pandas.io.sql.read_sql('SELECT * FROM Production.Product', conn)
tblProduct.head(n=3)

,ProductID,Name,ProductNumber,MakeFlag,FinishedGoodsFlag,Color,SafetyStockLevel,ReorderPoint,StandardCost,ListPrice,...,ProductLine,Class,Style,ProductSubcategoryID,ProductModelID,SellStartDate,SellEndDate,DiscontinuedDate,rowguid,ModifiedDate
0,1,Adjustable Race,AR-5381,False,False,None,1000,750,0.0,0.0,...,None,None,None,NaN,NaN,2008-04-30,NaT,None,694215B7-08F7-4C0D-ACB1-D734BA44C0C8,2014-02-08 10:01:36.827
1,2,Bearing Ball,BA-8327,False,False,None,1000,750,0.0,0.0,...,None,None,None,NaN,NaN,2008-04-30,NaT,None,58AE3C20-4F3A-4749-A7D4-D568806CC537,2014-02-08 10:01:36.827
2,3,BB Ball Bearing,BE-2349,True,False,None,800,600,0.0,0.0,...,None,None,None,NaN,NaN,2008-04-30,NaT,None,9C21AED2-5BFA-4F18-BCB8-F11638DC2E4E,2014-02-08 10:01:36.827

The same values can be seen when executing the query in SQL server

<img max-width=300px src="results2.png">